<?php 
namespace app\base\controller;

class ReturnCode
{
    /**
     * 项目返回码
     * @param $code
     * @param $data
     * @param $msg
     */
    static public $return_code = [
        //请求类1000段
        '1001' => '操作成功',
        '2001' => '操作失败',
        '1002' => '非法的请求', //非法的请求方式 非ajax
        '1003' => '请求参数错误', //如参数不完整,类型不正确
        '1004' => '请先登陆再访问', //未登录 或者 未授权
        '1005' => '请求授权不符', //非法的请求  无授权查看
        //数据类1010段
        '1010' => '数据不存在', 
        '1011' => '数据操作失败', 
        '1012' => '数据加载失败', 
        '1020' => '验证码输入不正确', 
        //登录类1020段
        '1021' => '用户账号或密码错误', 
        '1022' => '用户账号被禁用', 
        //注册类1030段
        '1031' => '管理员账号已存在', 
        '1032' => '管理员账号可以使用',
        '1033' => '手机号已存在',
        '1034' => '手机号可以使用',
        '1035' => '短信验证码正确',
        '1036' => '短信验证码错误',
        //修改账户1040段
        '1040' => '账号修改成功', 
        '1041' => '账号修改失败', 
        '1042' => '没有此手机号', 
        '1043' => '账号验证成功', 
        //短信1050段
        '1050' => '短信验证码已发送成功，请注意查收短信', 
        '1051' => '短信验证码发送失败，请联系客服或者再次发送', 
        '1052' => '参数错误', 
        
    ];
}


?>